# Задача 2: Сложение двух чисел
# Напишите программу, которая запрашивает у пользователя два числа и выводит их сумму.
# Пример:
# Ввод: 3, 5
# Вывод: Сумма: 8
n=int(input())
m=int(input())
sum=n+m
print(sum);